Revit 2027 API
ParameterTypeId.EnergyAnalysisCreateAnalyticalModel Property
 "Create Energy Model": Deprecated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId EnergyAnalysisCreateAnalyticalModel { get; }
Public Shared ReadOnly Property EnergyAnalysisCreateAnalyticalModel As ForgeTypeId
	Get
public:
static property ForgeTypeId^ EnergyAnalysisCreateAnalyticalModel {
	ForgeTypeId^ get ();
}
static member EnergyAnalysisCreateAnalyticalModel : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace